test_result/fio-3.28-4R5J0001-rw-1G-qd4-num1-128K-3000-WT.txt
fio: Any use of blockalign= turns off randommap
fio-3.28-4R5J0001-randwrite-1G-4-1-128K: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=4
fio-3.28
Starting 1 process
{
  "fio version" : "fio-3.28",
  "timestamp" : 1750685769,
  "timestamp_ms" : 1750685769611,
  "time" : "Mon Jun 23 21:36:09 2025",
  "global options" : {
    "ba" : "192K"
  },
  "jobs" : [
    {
      "jobname" : "fio-3.28-4R5J0001-randwrite-1G-4-1-128K",
      "groupid" : 0,
      "error" : 0,
      "eta" : 2147483647,
      "elapsed" : 2,
      "job options" : {
        "name" : "fio-3.28-4R5J0001-randwrite-1G-4-1-128K",
        "filename" : "/dev/sda",
        "rw" : "randwrite",
        "bs" : "128K",
        "size" : "1G",
        "runtime" : "3000",
        "ioengine" : "libaio",
        "direct" : "1",
        "iodepth" : "4",
        "numjobs" : "1",
        "group_reporting" : "1",
        "ramp_time" : "0"
      },
      "read" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "write" : {
        "io_bytes" : 1073741824,
        "io_kbytes" : 1048576,
        "bw_bytes" : 1111533979,
        "bw" : 1085482,
        "iops" : 8480.331263,
        "runtime" : 966,
        "total_ios" : 8192,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 6799,
          "max" : 62649,
          "mean" : 27026.662598,
          "stddev" : 13288.787601,
          "N" : 8192
        },
        "clat_ns" : {
          "min" : 159172,
          "max" : 706815,
          "mean" : 441048.923218,
          "stddev" : 76192.742777,
          "N" : 8192,
          "percentile" : {
            "1.000000" : 232448,
            "5.000000" : 296960,
            "10.000000" : 337920,
            "20.000000" : 407552,
            "30.000000" : 415744,
            "40.000000" : 432128,
            "50.000000" : 444416,
            "60.000000" : 448512,
            "70.000000" : 456704,
            "80.000000" : 468992,
            "90.000000" : 544768,
            "95.000000" : 602112,
            "99.000000" : 643072,
            "99.500000" : 659456,
            "99.900000" : 684032,
            "99.950000" : 684032,
            "99.990000" : 708608
          },
          "bins" : {
            "158720" : 1,
            "160768" : 1,
            "162816" : 2,
            "164864" : 4,
            "168960" : 1,
            "171008" : 1,
            "173056" : 3,
            "175104" : 3,
            "177152" : 2,
            "179200" : 4,
            "181248" : 3,
            "183296" : 4,
            "185344" : 4,
            "187392" : 1,
            "189440" : 1,
            "191488" : 2,
            "193536" : 3,
            "195584" : 3,
            "197632" : 6,
            "199680" : 10,
            "201728" : 7,
            "203776" : 7,
            "205824" : 4,
            "207872" : 1,
            "209920" : 2,
            "232448" : 2,
            "244736" : 2,
            "248832" : 1,
            "250880" : 1,
            "252928" : 4,
            "254976" : 1,
            "261120" : 1,
            "264192" : 5,
            "268288" : 3,
            "272384" : 6,
            "276480" : 8,
            "280576" : 14,
            "284672" : 38,
            "288768" : 69,
            "292864" : 117,
            "296960" : 97,
            "301056" : 64,
            "305152" : 17,
            "309248" : 28,
            "313344" : 39,
            "317440" : 48,
            "321536" : 23,
            "325632" : 31,
            "329728" : 50,
            "333824" : 49,
            "337920" : 51,
            "342016" : 51,
            "346112" : 34,
            "350208" : 22,
            "354304" : 16,
            "358400" : 17,
            "362496" : 8,
            "366592" : 6,
            "370688" : 4,
            "374784" : 10,
            "378880" : 14,
            "382976" : 36,
            "387072" : 37,
            "391168" : 47,
            "395264" : 64,
            "399360" : 125,
            "403456" : 213,
            "407552" : 302,
            "411648" : 356,
            "415744" : 294,
            "419840" : 201,
            "423936" : 186,
            "428032" : 172,
            "432128" : 233,
            "436224" : 224,
            "440320" : 324,
            "444416" : 507,
            "448512" : 619,
            "452608" : 540,
            "456704" : 454,
            "460800" : 310,
            "464896" : 223,
            "468992" : 162,
            "473088" : 146,
            "477184" : 90,
            "481280" : 62,
            "485376" : 72,
            "489472" : 55,
            "493568" : 51,
            "497664" : 26,
            "501760" : 16,
            "505856" : 15,
            "509952" : 14,
            "514048" : 14,
            "518144" : 16,
            "522240" : 19,
            "528384" : 34,
            "536576" : 33,
            "544768" : 52,
            "552960" : 63,
            "561152" : 82,
            "569344" : 79,
            "577536" : 64,
            "585728" : 41,
            "593920" : 66,
            "602112" : 80,
            "610304" : 88,
            "618496" : 67,
            "626688" : 44,
            "634880" : 43,
            "643072" : 29,
            "651264" : 14,
            "659456" : 19,
            "667648" : 15,
            "675840" : 12,
            "684032" : 7,
            "692224" : 2,
            "700416" : 1,
            "708608" : 1
          }
        },
        "lat_ns" : {
          "min" : 210778,
          "max" : 726508,
          "mean" : 468481.464844,
          "stddev" : 71585.126905,
          "N" : 8192
        },
        "bw_min" : 1085572,
        "bw_max" : 1085572,
        "bw_agg" : 100.000000,
        "bw_mean" : 1085572.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 1,
        "iops_min" : 8481,
        "iops_max" : 8481,
        "iops_mean" : 8481.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 1
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 965,
      "usr_cpu" : 13.056995,
      "sys_cpu" : 26.217617,
      "ctx" : 4091,
      "majf" : 0,
      "minf" : 10,
      "iodepth_level" : {
        "1" : 0.100000,
        "2" : 0.100000,
        "4" : 99.963379,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 1.037598,
        "500" : 86.413574,
        "750" : 12.548828,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ],
  "disk_util" : [
    {
      "name" : "sda",
      "read_ios" : 46,
      "write_ios" : 7465,
      "read_merges" : 0,
      "write_merges" : 0,
      "read_ticks" : 4,
      "write_ticks" : 3087,
      "in_queue" : 3091,
      "util" : 90.927625
    }
  ]
}

fio-3.28-4R5J0001-randwrite-1G-4-1-128K: (groupid=0, jobs=1): err= 0: pid=81186: Mon Jun 23 21:36:09 2025
  write: IOPS=8480, BW=1060MiB/s (1112MB/s)(1024MiB/966msec); 0 zone resets
    slat (nsec): min=6799, max=62649, avg=27026.66, stdev=13288.79
    clat (usec): min=159, max=706, avg=441.05, stdev=76.19
     lat (usec): min=210, max=726, avg=468.48, stdev=71.59
    clat percentiles (usec):
     |  1.00th=[  233],  5.00th=[  297], 10.00th=[  338], 20.00th=[  408],
     | 30.00th=[  416], 40.00th=[  433], 50.00th=[  445], 60.00th=[  449],
     | 70.00th=[  457], 80.00th=[  469], 90.00th=[  545], 95.00th=[  603],
     | 99.00th=[  644], 99.50th=[  660], 99.90th=[  685], 99.95th=[  685],
     | 99.99th=[  709]
   bw (  MiB/s): min= 1060, max= 1060, per=100.00%, avg=1060.13, stdev= 0.00, samples=1
   iops        : min= 8481, max= 8481, avg=8481.00, stdev= 0.00, samples=1
  lat (usec)   : 250=1.04%, 500=86.41%, 750=12.55%
  cpu          : usr=13.06%, sys=26.22%, ctx=4091, majf=0, minf=10
  IO depths    : 1=0.1%, 2=0.1%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,8192,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
  WRITE: bw=1060MiB/s (1112MB/s), 1060MiB/s-1060MiB/s (1112MB/s-1112MB/s), io=1024MiB (1074MB), run=966-966msec

Disk stats (read/write):
  sda: ios=46/7465, merge=0/0, ticks=4/3087, in_queue=3091, util=90.93%